// pages/home/news_item.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    listNews: [{
      id: 0,
      imgPath: '../img/news/news1.jpg',
      title: "价格三千和价格一万的牙齿矫正区别在哪？",
      summary: "",
      detail: "网友真事：\n\n朋友在普通诊所矫正门牙缝隙耗时2年，三年后又恢复了原样。我矫正过两次，很想说一下。我初中时矫正第一次，在镇上的一个医院(还某某区第二人民医院) ，1000多那种，当时就是牙齿外凸，矫正好稍有好转，但是没有让我完全满意，爸爸说什么都不能做到完美的呀，我就也没有怎么在意了。上大学后室友很惊讶我竟然是矫正过牙齿的！\n\n上大学后，因为有口腔课，老师越上课，我越觉得自己牙齿丑，而且侧面看嘴是凸的。于是去找老师再次矫正了。是我们学校的附属医院，正常费用是1万多到3万多，我找老师拿的友情价(具体是多少就不说了) 。\n\n第一次矫正时是没有拔牙的，这次拔了八颗。之后会打支抗钉，我相信这次一定会很有效果。其实矫正牙齿的材料真的是不贵，完全是靠医生的技术，以前那个医生竟然没有给我拔牙？把我牙齿硬往里挤？上过口腔课之后我真的好怀疑那医生的技术。\n\n\n\n为什么正畸费用差异这么大呢？\n\n其实很重要的原因是矫正牙齿是个性化的医疗服务，并不是可以简单复制、衡量的『商品』。所以，无法根据结果给出一个评判进而去定价。\n\n举个容易理解的例子，有点像学生的补习班，每个学生基础不一样，对于20分的学生能提高到60分，那么这个培训班就是超值；但对于80分提高到85分，可能上不上这个培训班就需要商榷了。\n\n正畸治疗并没有一个严格的标准，所以，更不能用一个结束的标准去定价，大家常见的都是以年龄，比如成人正畸和青少年正畸，来大致区分治疗的差异。\n\n正畸收费的特点就是技术占主导，而不是结果。不同资历的医生收费的差异会高达数十倍。\n\n其实，很容易理解，技术活嘛，收费有差异，正常。\n\n在美国找正畸医生做正畸比找牙医做正畸一般是会贵一倍左右。这是有严格专科准入制度和非常标准的医生培养机制前提下的稳定差价。当然也会有很多收费差异非常大的个例。\n\n在国内，除了相同的问题，还有正畸市场的混乱，没有专科准入导致正畸水平天壤之别，甚至可以说从不要钱到几十万的收费都有。可以给你一些个人参考，大的方向来说这个世界上除了蓄意欺骗，绝大数都是一分钱一分货。\n\n面对这种情况我们如何去选择呢？\n\n\n\n但是金钱是有限的，任何东西都可以找到一个性价比高的拐点，这个需要非常熟悉市场的人来帮你；\n\n而对于正畸来说，小编建议首先需要找正畸专科医生来进行治疗，其次规范的医疗环境，对于健康是基本保证。其次朋友亲戚的口碑也是非常重要的，找到靠谱的医生，基本收费也不会偏离多少。\n\n牙齿每天的工作时间很长，如果是吃货那牙齿还是要加班的，所以在牙齿上投资要谨慎！更要明白牙齿自己的诉求，一味地看中一时的价格，可能会毁了整口牙。\n\n牙齿矫正是需要医生精心、精密、精细化设计及操作过程的项目，记住一定要选择专业的正畸机构！"
    }, 
    {
      id: 1,
      imgPath: '../img/news/news2.jpg',
      title: "牙齿美白三种方法：冷光美白、烤瓷牙美白和贴面美白 →→最佳选择是贴面美白中的冰瓷牙（全瓷贴面）",
      summary: "",
      detail: "你有没有被人嫌弃过牙齿黄？怕影响形象不敢随意张口？抛去难看不说，妹子们都没法好好涂口红了，口红色加上发黄的牙，简直就是西红柿炒鸡蛋\n相信大家对牙齿美白的方法还是有一定了解的。目前，市面上有冷光美白、烤瓷牙美白，贴面美白这三种方式进行美白。但是到底具体怎么选择，它们优势是什么？不足是什么？真的适合我吗?看完今天这篇，相信你会选一款合适你的美牙方式。\n\n冷 光 美 白:\n号称快速而又安全的牙齿美白技术。\n\n原理：\n低温冷光避免了治疗过程中对牙神经的刺激。\n美白剂的主要成分为过氧化氢。在牙龈边缘涂上一层保护剂，然后在牙面涂美白剂，用冷光美白灯照射(根据牙齿染色程度光照8～10分钟) ，之后除掉美白剂，再涂一层新的美白剂。此过程反复三次，全过程不过30～40分钟而已。\n\n适宜症：\n轻度外因性色素牙(咖啡、茶渍、烟渍沉积) 、轻度四环素牙等。\n\n持续时间：\n半年左右。\n\n优势：\n冷光牙齿美白技术，其效果可提高5个色阶到14个色阶; 所采用的低温冷光，避免了操作过程中对牙神经的损害; 操作过程完全不接触牙龈，对牙齿结构不会造成损害。\n\n不足：\n冷光美白其实仍旧是通过漂白药物来美白牙齿，激光只是提高上药脱色速度的辅助工具。\n在操作的过程牙齿感觉比较酸痛，正是由于漂白剂对牙齿表面釉质有损害，做完出现牙本质过敏(冷热反应)甚至牙齿脆化的几率较大。\n手法不当的话，也会容易造成牙齿容易冷热过敏，牙龈肿胀。\n\n烤 瓷 牙 美 白\n如果你的牙齿有缺损又想美白，选烤瓷牙是十分合适的。这也是目前密合度最好、颜色效果最接近天然色的口腔修复体。\n\n适宜症：\n适用于中、重度四环素牙、氟斑牙、釉质发育不全、牙齿有裂纹、残缺等严重个例，美白效果明显。持续时间理论上如果牙龈健康不出问题，日常护理较好(事实很难做到这一点) ，能保持十几年甚至终生。\n\n优势：\n美白牙齿效果明显，要多白都可以，比较持久甚至可以一劳永逸哦。如果您的牙齿缺损严重或者是过小牙，做烤瓷牙是比较合适的。\n\n不足：\n但是单纯想改色的话，做烤瓷牙先要把原本的牙齿磨小，对牙齿造成的破坏是不可逆。磨成棒状的牙齿非常脆弱噢。\n在一段时间后，比较容易出现牙龈炎、牙周炎、牙龈萎缩等后遗症。\n\n贴 面 美 白\n\n原理：\n贴面美白是在牙齿表面粘上一层牙贴面，遮盖牙齿缺陷、改色等。\n现在流行的牙齿贴面可以分为树脂贴面和全瓷贴面（冰瓷牙）两种。它们都是在磨去部分舌面的牙齿，并且在牙齿表面贴上牙贴面，可以保持牙齿的形状和原来一样。\n相比较而言，全瓷贴面更加轻薄，它可以做到少量磨牙或者不磨牙。\n\n适宜症：\n四环素牙、氟斑牙，瓜子牙及遗传性黄牙，瓜子牙，牙齿缺损，牙齿过小等。\n\n持续时间：\n树脂贴面会老化，若干年后需要重新更换；全瓷贴面理论上可以持续用十年。\n\n优势：\n瓷贴面与树脂贴面相比，色泽好，形态好，跟真牙几乎毫无区别，它的制作工艺很精细，不止可以牙齿美白，也是治疗牙体缺损、牙列缺失的主要方法。\n\n不足：\n对牙釉质要求比较高，如果你的牙釉质缺损大于70% 是不建议做全瓷贴面。由于瓷贴面的轻薄属性，对于一些颜色比较深的牙齿，需要较白的色阶才可以达到遮色效果。"
    }
    ],
    currentItem: ""
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function(options) {
    this.setData({
        currentItem: this.data.listNews[options.id]
      }),
      wx.setNavigationBarTitle({
        title: this.data.currentItem.title
      })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function() {

  }
})